solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pca9422/fsl_pca9422.h
#define PCA9422_SUB_INT2_VOUTSW1  (0x80U)
#define PCA9422_SUB_INT2_VOUTSW2  (0x40U)
#define PCA9422_SUB_INT2_VOUTSW3  (0x20U)
#define PCA9422_SUB_INT2_VOUTSW4  (0x10U)
#define PCA9422_SUB_INT2_VOUTLDO1 (0x08U)
#define PCA9422_SUB_INT2_VOUTLDO2 (0x04U)
#define PCA9422_SUB_INT2_VOUTLDO3 (0x02U)
#define PCA9422_SUB_INT2_VOUTLDO4 (0x01U)
#define PCA9422_SUB_INT2_ALL      (0xFFU)

#define PCA9422_TOP_STAT_SHIP_HISTORY (0x02U)
#define PCA9422_TOP_STAT_OCP_HISTORY  (0x01U)

#define PCA9422_TOP_CNTL0_WD_TIMER            (0xC0U)
#define PCA9422_TOP_CNTL0_SHIP_MODE_EN        (0x10U)
#define PCA9422_TOP_CNTL0_PWR_DN_EN           (0x08U)
#define PCA9422_TOP_CNTL0_nEN_CHG_IN_WATCHDOG (0x04U)
#define PCA9422_TOP_CNTL0_RESET_CFG           (0x02U)

#define PCA9422_TOP_CNTL1_SW_GLOBAL_RST_READY (0x04U)
#define PCA9422_TOP_CNTL1_THERMAL_WARNING     (0x03U)

#define PCA9422_TOP_CNTL2_THERM_SHDN   (0x1CU)
#define PCA9422_TOP_CNTL2_ON_GLT_SHORT (0x03U)

#define PCA9422_TOP_CNTL3_VSYS_MIN_WARNING (0x78U)
#define PCA9422_TOP_CNTL3_SW_GLOBAL_RST    (0x04U)
#define PCA9422_TOP_CNTL3_ON_GLT_LONG      (0x03U)

#define PCA9422_TOP_CNTL4_WD_TIMER_CLR (0x07U)

/*! @brief Define the Register Masks - Battery Charger Register. */
#define PCA9422_INT_DEVICE_0_VIN_SAFE_0V (0x04U)
#define PCA9422_INT_DEVICE_0_VIN_NOK     (0x02U)
#define PCA9422_INT_DEVICE_0_VIN_OK      (0x01U)

#define PCA9422_INT_DEVICE_1_VIN_I_LIMIT          (0x80U)
#define PCA9422_INT_DEVICE_1_VSYS_SUPPLEMENT_EXIT (0x40U)
#define PCA9422_INT_DEVICE_1_VSYS_SUPPLEMENT      (0x20U)
#define PCA9422_INT_DEVICE_1_VSYS_OVER_LOAD       (0x10U)
#define PCA9422_INT_DEVICE_1_VIN_AICL_RELEASE     (0x08U)
#define PCA9422_INT_DEVICE_1_VIN_AICL             (0x04U)
#define PCA9422_INT_DEVICE_1_VIN_OVP_EXIT         (0x02U)
#define PCA9422_INT_DEVICE_1_VIN_OVP              (0x01U)

#define PCA9422_INT_CHARGER_0_TOPOFF       (0x80U)
#define PCA9422_INT_CHARGER_0_CV_MODE      (0x40U)
#define PCA9422_INT_CHARGER_0_FAST_CHARGE  (0x20U)
#define PCA9422_INT_CHARGER_0_PRECHARGE    (0x10U)
#define PCA9422_INT_CHARGER_0_CHARGER_OFF  (0x08U)
#define PCA9422_INT_CHARGER_0_CHARGER_ON   (0x04U)
#define PCA9422_INT_CHARGER_0_CHG_QUAL_NOK (0x02U)
#define PCA9422_INT_CHARGER_0_CHG_QUAL_OK  (0x01U)

#define PCA9422_INT_CHARGER_1_THERM_HOT       (0x80U)
#define PCA9422_INT_CHARGER_1_THERM_WARM_PLUS (0x40U)
#define PCA9422_INT_CHARGER_1_THERM_WARM      (0x20U)
#define PCA9422_INT_CHARGER_1_THERM_COOL      (0x10U)
#define PCA9422_INT_CHARGER_1_THERM_COLD      (0x08U)
#define PCA9422_INT_CHARGER_1_VBAT_OVP_EXIT   (0x04U)
#define PCA9422_INT_CHARGER_1_VBAT_OVP        (0x02U)
#define PCA9422_INT_CHARGER_1_NO_BATTERY      (0x01U)

#define PCA9422_INT_CHARGER_2_RECHARGE            (0x80U)
#define PCA9422_INT_CHARGER_2_CHARGE_DONE         (0x40U)
#define PCA9422_INT_CHARGER_2_THERMAL_REGULATION  (0x20U)
#define PCA9422_INT_CHARGER_2_TOP_OFF_TIMER_OUT   (0x10U)
#define PCA9422_INT_CHARGER_2_FAST_CHG_TIMER_OUT  (0x08U)
#define PCA9422_INT_CHARGER_2_PRECHARGE_TIMER_OUT (0x04U)
#define PCA9422_INT_CHARGER_2_THERM_DISABLE       (0x02U)
#define PCA9422_INT_CHARGER_2_THERM_OPEN          (0x01U)

#define PCA9422_INT_CHARGER_3_VBAT_OCP (0x01U)

#define PCA9422_VIN_CNTL_0_VIN_PD_EN (0x02U)

#define PCA9422_VIN_CNTL_1_FORCE_DISCHARGE_VSYS_EN (0x08U)
#define PCA9422_VIN_CNTL_1_AICL_V                  (0x06U)
#define PCa9422_VIN_CNTL_1_AICL_EN                 (0x01U)

#define PCA9422_VIN_CNTL_2_VIN_I_LIMIT (0x1FU)

#define PCA9422_VIN_CNTL_3_VSYS_REG (0xF0U)

#define PCA9422_CHARGER_CNTL_0_CHARGER_LOCK (0x30U)

#define PCA9422_CHARGER_CNTL_1_BAT_PRESENCE_DET_DISABLE (0x40U)
#define PCA9422_CHARGER_CNTL_1_AUTOSTOP_CHG_EN          (0x20U)
#define PCA9422_CHARGER_CNTL_1_CHARGER_EN               (0x10U)
#define PCA9422_CHARGER_CNTL_1_V_WARM_50C               (0x0CU)
#define PCA9422_CHARGER_CNTL_1_PRECHG_CURRENT           (0x02U)
#define PCA9422_CHARGER_CNTL_1_CHG_CURRENT_STEP         (0x01U)

#define PCA9422_CHARGER_CNTL_2_VBAT_REG (0x7FU)

#define PCA9422_CHARGER_CNTL_3_I_FAST_CHG (0x7FU)

#define PCA9422_CHARGER_CNTL_4_VBAT_OVP_DEB   (0xC0U)
#define PCA9422_CHARGER_CNTL_4_RECHARGE_TH    (0x30U)
#define PCA9422_CHARGER_CNTL_4_TOPOFF_CURRENT (0x0CU)
#define PCA9422_CHARGER_CNTL_4_PRE_CHG_TIMER  (0x03U)

#define PCA9422_CHARGER_CNTL_5_THERM_NTC_EN      (0x40U)
#define PCA9422_CHARGER_CNTL_5_OCP_DISCHARGE_DEB (0x30U)
#define PCA9422_CHARGER_CNTL_5_OCP_DISCHARGE     (0x03U)

#define PCA9422_CHARGER_CNTL_6_V_HOT_60C  (0xC0U)
#define PCA9422_CHARGER_CNTL_6_V_WARM_45C (0x30U)
#define PCA9422_CHARGER_CNTL_6_V_COOL_10C (0x0CU)
#define PCA9422_CHARGER_CNTL_6_V_COLD_0C  (0x03U)

#define PCA9422_CHARGER_CNTL_7_FAST_CHG_TIMER             (0xC0U)
#define PCA9422_CHARGER_CNTL_7_2X_ALL_TIMERS_EN           (0x20U)
#define PCA9422_CHARGER_CNTL_7_CHG_DISABLE_AT_COLD_HOT_EN (0x10U)
#define PCA9422_CHARGER_CNTL_7_NEW_I_VBAT_AT_10C          (0x0CU)
#define PCA9422_CHARGER_CNTL_7_NEW_VBAT_AT_45C            (0x03U)

#define PCA9422_CHARGER_CNTL_8_THERMAL_REGULATION (0x38U)
#define PCA9422_CHARGER_CNTL_8_TOP_OFF_TIMER      (0x07U)

#define PCA9422_CHARGER_CNTL_9_NEW_VBAT_AT_50C         (0xC0U)
#define PCA9422_CHARGER_CNTL_9_NEW_I_VBAT_AT_50C       (0x30U)
#define PCA9422_CHARGER_CNTL_9_NEW_I_VBAT_AT_45C       (0x0CU)
#define PCA9422_CHARGER_CNTL_9_FORCE_DISCHARGE_VBAT_EN (0x02U)
#define PCA9422_CHARGER_CNTL_9_USB_SUSPEND             (0x01U)

#define PCA9422_CHARGER_CNTL_10_AMUX_AUTO_OFF_WAIT  (0xC0U)
#define PCA9422_CHARGER_CNTL_10_AMUX_MODE           (0x20U)
#define PCA9422_CHARGER_CNTL_10_AMUX_VBAT_VSYS_GAIN (0x10U)
#define PCA9422_CHARGER_CNTL_10_AMUX_THERM_GAIN     (0x08U)
#define PCA9422_CHARGER_CNTL_10_AMUX_CHANNEL        (0x07U)

/*! @brief Define the Register Masks - Regulator Register. */
#define PCA9422_INT1_VR_FLT1     (0x08U)
#define PCA9422_INT1_BB_FAULT_OC (0x01U)

#define PCA9422_PWR_STATE_PWR_STAT (0xF0U)
#define PCA9422_PWR_STATE_PWR_MODE (0x0FU)

#define PCA9422_RESET_CTRL_TRESTART (0x08U)

#define PCA9422_SW_RST_SW_RST_KEY (0xFFU)

#define PCA9422_PWR_SEQ_CTRL_ON_CFG          (0x80U)
#define PCA9422_PWR_SEQ_CTRL_MODE_SEL_BY_PIN (0x40U)
#define PCA9422_PWR_SEQ_CTRL_MODE_I2C        (0x30U)
#define PCA9422_PWR_SEQ_CTRL_PSQ_TON_STEP    (0x0CU)
#define PCA9422_PWR_SEQ_CTRL_PSQ_TOFF_STEP   (0x03U)

