solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pca9422/fsl_pca9422.h
#define PCA9422_SYS_CFG1_VIN_VALID_CFG (0x80U)
#define PCA9422_SYS_CFG1_STANDBY_CTRL  (0x40U)
#define PCA9422_SYS_CFG1_STANDBY_CFG   (0x20U)
#define PCA9422_SYS_CFG1_DVS_CTRL2_EN  (0x04U)
#define PCA9422_SYS_CFG1_TFLT_SD_WAIT  (0x02U)
#define PCA9422_SYS_CFG1_THERM_SD_DIS  (0x01U)

#define PCA9422_SYS_CFG2_PWR_SAVE        (0x30U)
#define PCA9422_SYS_CFG2_GPIO_PULLUP_CFG (0x08U)
#define PCA9422_SYS_CFG2_POK_PU          (0x04U)
#define PCA9422_SYS_CFG2_VSYS_UVLO_SEL   (0x03U)

#define PCA9422_REG_STATUS_VOUTSW1_OK  (0x80U)
#define PCA9422_REG_STATUS_VOUTSW2_OK  (0x40U)
#define PCA9422_REG_STATUS_VOUTSW3_OK  (0x20U)
#define PCA9422_REG_STATUS_VOUTSW4_OK  (0x10U)
#define PCA9422_REG_STATUS_VOUTLDO1_OK (0x08U)
#define PCA9422_REG_STATUS_VOUTLDO2_OK (0x04U)
#define PCA9422_REG_STATUS_VOUTLDO3_OK (0x02U)
#define PCA9422_REG_STATUS_VOUTLDO4_OK (0x01U)

/* BUCK */
#define PCA9422_BUCK123_DVS_CFG1_B1_DVS_UP  (0x80U)
#define PCA9422_BUCK123_DVS_CFG1_B1_DVS_DN  (0x40U)
#define PCA9422_BUCK123_DVS_CFG1_B2_DVS_UP  (0x20U)
#define PCA9422_BUCK123_DVS_CFG1_B2_DVS_DN  (0x10U)
#define PCA9422_BUCK123_DVS_CFG1_MODE_PULSE (0x08U)
#define PCA9422_BUCK123_DVS_CFG1_SMART_MODE (0x04U)
#define PCA9422_BUCK123_DVS_CFG1_BUCK_SEL   (0x03U)

#define PCA9422_BUCK123_DVS_CFG2_B1_DVS_CTRL (0xC0U)
#define PCA9422_BUCK123_DVS_CFG2_B2_DVS_CTRL (0x30U)
#define PCA9422_BUCK123_DVS_CFG2_B3_DVS_CTRL (0x0CU)
#define PCA9422_BUCK123_DVS_CFG2_B3_DVS_UP   (0x02U)
#define PCA9422_BUCK123_DVS_CFG2_B3_DVS_DN   (0x01U)

#define PCA9422_BUCKXCTRL_BX_RAMP   (0xC0U)
#define PCA9422_BUCKXCTRL_BX_LPMODE (0x30U)
#define PCA9422_BUCKXCTRL_BX_AD     (0x08U)
#define PCA9422_BUCKXCTRL_BX_FPWM   (0x04U)
#define PCA9422_BUCKXCTRL_BX_ENMODE (0x03U)

#define PCA9422_BUCKXOUT_DVS0_BX_DVS0           (0xFFU)
#define PCA9422_BUCKXOUT_DVS1_BX_DVS1           (0xFFU)
#define PCA9422_BUCKXOUT_DVS2_BX_DVS2           (0xFFU)
#define PCA9422_BUCKXOUT_DVS3_BX_DVS3           (0xFFU)
#define PCA9422_BUCKXOUT_DVS4_BX_DVS4           (0xFFU)
#define PCA9422_BUCKXOUT_DVS5_BX_DVS5           (0xFFU)
#define PCA9422_BUCKXOUT_DVS6_BX_DVS6           (0xFFU)
#define PCA9422_BUCKXOUT_DVS7_BX_DVS7           (0xFFU)
#define PCA9422_BUCKXOUT_STDBY_BX_STDBY         (0xFFU)
#define PCA9422_BUCKXOUT_MAX_LIMIT_BX_MAX_LIMIT (0xFFU)
#define PCA9422_BUCKXOUT_SLEEP_BX_SLEEP         (0xFFU)

#define PCA9422_LPM_FPWM_B3_LPM_FPWM_EN (0x04U)
#define PCA9422_LPM_FPWM_B2_LPM_FPWM_EN (0x02U)
#define PCA9422_LPM_FPWM_B1_LPM_FPWM_EN (0x01U)

/* LDO2 */
#define PCA9422_LDO2_CFG_L2_CSEL   (0xC0U)
#define PCA9422_LDO2_CFG_L2_LLSEL  (0x30U)
#define PCA9422_LDO2_CFG_L2_LPMODE (0x0CU)
#define PCA9422_LDO2_CFG_L2_ENMODE (0x03U)

#define PCA9422_LDO2_OUT_L2_AD        (0x80U)
#define PCA9422_LDO2_OUT_L2_INL2_MDET (0x40U)
#define PCA9422_LDO2_OUT_L2_OUT       (0x3FU)

#define PCA9422_LDO2_OUT_STBY_L2_OUT_STBY (0x3FU)

/* LDO3 */
#define PCA9422_LDO3_CFG_L3_CSEL   (0xC0U)
#define PCA9422_LDO3_CFG_L3_LLSEL  (0x30U)
#define PCA9422_LDO3_CFG_L3_LPMODE (0x0CU)
#define PCA9422_LDO3_CFG_L3_ENMODE (0x03U)

#define PCA9422_LDO3_OUT_L3_AD        (0x80U)
#define PCA9422_LDO3_OUT_L3_INL3_MDET (0x40U)
#define PCA9422_LDO3_OUT_L3_OUT       (0x3FU)

#define PCA9422_LDO3_OUT_STBY_L3_OUT_STBY (0x3FU)

#define PCA9422_LDO23_CFG_LDO3_MODE    (0x80U)
#define PCA9422_LDO23_CFG_LDO2_MODE    (0x40U)
#define PCA9422_LDO23_CFG_L2_INL2_VSEL (0x20U)
#define PCA9422_LDO23_CFG_L3_INL3_VSEL (0x10U)

/* LDO4 */
#define PCA9422_LDO4_CFG_L4_AD     (0x10U)
#define PCA9422_LDO4_CFG_L4_ENMODE (0x03U)
#define PCA9422_LDO4_OUT_L4_OUT    (0x7FU)

#define PCA9422_LDO4_OUT_STBY_L4_OUT_STBY (0x7FU)

/* LDO1 */
#define PCA9422_LDO1_CFG1_L1_AD  (0x80U)
#define PCA9422_LDO1_CFG1_L1_OUT (0x7FU)

#define PCA9422_LDO1_CFG2_L1_ENMODE (0x01U)

#define PCA9422_LDO2_OUT_SLEEP_L2_OUT_SLEEP (0x3FU)
#define PCA9422_LDO3_OUT_SLEEP_L3_OUT_SLEEP (0x3FU)
#define PCA9422_LDO4_OUT_SLEEP_L4_OUT_SLEEP (0x7FU)

/* SW4 BB */
#define PCA9422_SW4_BB_CFG1_BB_FPWM          (0x08U)
#define PCA9422_SW4_BB_CFG1_BB_FAULT_OC_CTRL (0x04U)
#define PCA9422_SW4_BB_CFG1_BB_SOFT_STDN     (0x02U)
#define PCA9422_SW4_BB_CFG1_BB_DIS           (0x01U)

#define PCA9422_SW4_BB_CFG2_BB_ENABLE  (0x40U)
#define PCA9422_SW4_BB_CFG2_BB_MODESEL (0x30U)
#define PCA9422_SW4_BB_CFG2_BB_ENMODE  (0x0CU)
#define PCA9422_SW4_BB_CFG2_BB_LPMODE  (0x03U)

#define PCA9422_SW4_BB_CFG3_BB_VOUT             (0xFFU)
#define PCA9422_SW4_BB_CFG4_BB_VOUT_STBY        (0xFFU)
#define PCA9422_SW4_BB_MAX_LIMIT_BB_MAX_LMT     (0xFFU)
#define PCA9422_SW4_BB_MIM_LIMIT_BB_MIM_LMT     (0xFFU)
#define PCA9422_SW4_BB_VOUT_SLEEP_BB_VOUT_SLEEP (0xFFU)

/* LED */
#define PCA9422_LED_CFG1_LED_EN   (0x80U)
#define PCA9422_LED_CFG1_LED_RAMP (0x40U)
#define PCA9422_LED_CFG1_LED_PWM  (0x3FU)

#define PCA9422_LED_CFG2_LEDOVRD     (0x20U)
#define PCA9422_LED_CFG2_LED_CFG     (0x10U)
#define PCA9422_LED_CFG2_LED_CURRENT (0x0CU)
#define PCA9422_LED_CFG2_LED_FREQ    (0x03U)

/* GPIO */
#define PCA9422_GPIO_STATUS_GPIO_STATUS (0x01U)

#define PCA9422_GPIO_CFG_GPIO_OUT      (0x80U)
#define PCA9422_GPIO_CFG_GPIO_R_CFG2   (0x40U)
#define PCA9422_GPIO_CFG_GPIO_R_CFG1   (0x20U)
#define PCA9422_GPIO_CFG_GPIO_OUT_CFG  (0x10U)
#define PCA9422_GPIO_CFG_GPIO_GPIO_CFG (0x0FU)

/* Regulator EN */
#define PCA9422_REGULATOR_EN_B1_ENABLE (0x20U)
#define PCA9422_REGULATOR_EN_B2_ENABLE (0x10U)
#define PCA9422_REGULATOR_EN_B3_ENABLE (0x08U)
#define PCA9422_REGULATOR_EN_L2_ENABLE (0x04U)
#define PCA9422_REGULATOR_EN_L3_ENABLE (0x02U)
#define PCA9422_REGULATOR_EN_L4_ENABLE (0x01U)

/* Wakeup Sequence */
#define PCA9422_WAKEUP_SEQ1_BB_WAKEUP_GR (0xC0U)
#define PCA9422_WAKEUP_SEQ1_B3_WAKEUP_GR (0x30U)
#define PCA9422_WAKEUP_SEQ1_B2_WAKEUP_GR (0x0CU)
#define PCA9422_WAKEUP_SEQ1_B1_WAKEUP_GR (0x03U)

#define PCA9422_WAKEUP_SEQ2_WAKEUP_SEQ_CFG (0xC0U)
#define PCA9422_WAKEUP_SEQ2_L4_WAKEUP_GR   (0x30U)
#define PCA9422_WAKEUP_SEQ2_L3_WAKEUP_GR   (0x0CU)
#define PCA9422_WAKEUP_SEQ2_L2_WAKEUP_GR   (0x03U)

