solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pca9422/fsl_pca9422.h
#define PCA94R22_REG_LOCK_UNLOCK_KEY (0xFFU)

/*! @brief PCA9422 Device information */
/*! @brief PCA9422 Device revision */
typedef enum _pca9422_dev_rev
{
    kPCA9422_DevRevA0 = 0x00U, /* Device revision A0 */
    kPCA9422_DevRevB0 = 0x01U, /* Device revision B0 */
    kPCA9422_DevRevB1 = 0x02U, /* Device revision B1 */
} pca9422_dev_rev_t;

/*! @brief PCA9422 Top level function definition. */
/*! @brief PCA9422 Watchdog timer setting definition. */
typedef enum _pca9422_wd_timer
{
    kPCA9422_WdTimerDisabled = 0x00U, /* Watch dog timer disabled. */
    kPCA9422_WdTimer16s      = 0x40U, /* Watch dog timer timeout value is 16 sec. */
    kPCA9422_WdTimer32s      = 0x80U, /* Watch dog timer timeout value is 32 sec. */
    kPCA9422_WdTimer64s      = 0xC0U, /* Watch dog timer timeout value is 64 sec. */
} pca9422_wd_timer_t;

/*! @brief PCA9422 Battery Charger definition. */
/*! @brief PCA9422 AICL threshold on VIN definition. */
typedef enum _pca9422_aicl_v
{
    kPCA9422_AICLV4p5V = 0x00U, /* AICL Threshould on VIN is 4.5V */
    kPCA9422_AICLV4p6V = 0x02U, /* AICL Threshould on VIN is 4.6V */
    kPCA9422_AICLV4p7V = 0x04U, /* AICL Threshould on VIN is 4.7V */
    kPCA9422_AICLV4p8V = 0x06U, /* AICL Threshould on VIN is 4.8V */
} pca9422_aicl_v_t;

/*! @brief PCA9422 Input Current Limit on VIN definition. */
typedef enum _pca9422_vin_ilim
{
    kPCA9422_VinIlim_45mA   = 0x00U,
    kPCA9422_VinIlim_70mA   = 0x01U,
    kPCA9422_VinIlim_95mA   = 0x02U,
    kPCA9422_VinIlim_120mA  = 0x03U,
    kPCA9422_VinIlim_145mA  = 0x04U,
    kPCA9422_VinIlim_170mA  = 0x05U,
    kPCA9422_VinIlim_195mA  = 0x06U,
    kPCA9422_VinIlim_220mA  = 0x07U,
    kPCA9422_VinIlim_245mA  = 0x08U,
    kPCA9422_VinIlim_270mA  = 0x09U,
    kPCA9422_VinIlim_295mA  = 0x0AU,
    kPCA9422_VinIlim_320mA  = 0x0BU,
    kPCA9422_VinIlim_345mA  = 0x0CU,
    kPCA9422_VinIlim_370mA  = 0x0DU,
    kPCA9422_VinIlim_395mA  = 0x0EU,
    kPCA9422_VinIlim_420mA  = 0x0FU,
    kPCA9422_VinIlim_445mA  = 0x10U,
    kPCA9422_VinIlim_470mA  = 0x11U,
    kPCA9422_VinIlim_495mA  = 0x12U,
    kPCA9422_VinIlim_520mA  = 0x13U,
    kPCA9422_VinIlim_545mA  = 0x14U,
    kPCA9422_VinIlim_570mA  = 0x15U,
    kPCA9422_VinIlim_595mA  = 0x16U,
    kPCA9422_VinIlim_620mA  = 0x17U,
    kPCA9422_VinIlim_645mA  = 0x18U,
    kPCA9422_VinIlim_670mA  = 0x19U,
    kPCA9422_VinIlim_695mA  = 0x1AU,
    kPCA9422_VinIlim_795mA  = 0x1BU,
    kPCA9422_VinIlim_895mA  = 0x1CU,
    kPCA9422_VinIlim_995mA  = 0x1DU,
    kPCA9422_VinIlim_1095mA = 0x1EU,
    kPCA9422_VinIlim_1195mA = 0x1FU,
} pca9422_vin_ilim_t;

/*! @brief PCA9422 VSYS Regulation voltage definition. */
#define PCA9422_VSYS_REG_MIN      (4425U)
#define PCA9422_VSYS_REG_MAX      (4800U)
#define PCA9422_VSYS_REG_STEP     (25U)
#define PCA9422_VSYS_REG(_volt)   (((_volt) - PCA9422_VSYS_REG_MIN) / PCA9422_VSYS_REG_STEP)
#define PCA9422_VBAT_CLAMP_OFFSET (200U)

/*! @brief PCA9422 Unlock or lock all Charger Control register definition. */
#define PCA9422_CHARGER_LOCK_UNLOCK (0x30U)
#define PCA9422_CHARGER_LOCK_LOCK   (0x00U)

/*! @brief PCA922 V_WARM_50C threshold definition. */
typedef enum _pca9422_v_warm_50c
{
    kPCA9422_Vwarm50C40p75percent = 0x00U, /* Vwarm threshold is 40.75% of VTHREM_BIAS. */
    kPCA9422_Vwarm50C36p53percent = 0x04U, /* Vwarm threshold is 36.53% of VTHREM_BIAS. */
    kPCA9422_Vwarm50C32p63percent = 0x08U, /* Vwarm threshold is 32.63% of VTHREM_BIAS. */
    kPCA9422_Vwarm50C29p07percent = 0x0CU, /* Vwarm threshold is 29.07% of VTHREM_BIAS. */
} pca9422_v_warm_50c_t;

/*! @brief PCA922 V_WARM_45C threshold definition. */
typedef enum _pca9422_v_warm_45c
{
    kPCA9422_Vwarm45C40p75percent = 0x00U, /* Vwarm threshold is 40.75% of VTHREM_BIAS. */
    kPCA9422_Vwarm45C36p53percent = 0x10U, /* Vwarm threshold is 36.53% of VTHREM_BIAS. */
    kPCA9422_Vwarm45C32p63percent = 0x20U, /* Vwarm threshold is 32.63% of VTHREM_BIAS. */
    kPCA9422_Vwarm45C29p07percent = 0x30U, /* Vwarm threshold is 29.07% of VTHREM_BIAS. */
} pca9422_v_warm_45c_t;

/*! @brief PCA9422 Precharge Current definition. */
typedef enum _pca9422_prechg_i
{
    kPCA9422_PrechgI7p5percent = 0x00U, /* Precharge current is 7.5% of Fast charge current. */
    kPCA9422_PrechgI17percent  = 0x02U, /* Precharge current is 17% of Fast charge current. */
} pca9422_prechg_i_t;

/*! @brief PCA9422 current step on battery charge current definition. */
typedef enum _pca9422_chg_i_step
{
    kPCA9422_ChgIStep2p5mA = 0x00U, /* Battery charge current step is 2.5mA. */
    kPCA9422_ChgIStep5p0mA = 0x01U, /* Battery charge current step is 5.0mA. */
} pca9422_chg_i_step_t;

/*! @brief PCA9422 VBAT floating voltage definition. */
#define PCA9422_VBAT_REG_MIN    (3600U)
#define PCA9422_VBAT_REG_MAX    (4600U)
#define PCA9422_VBAT_REG_STEP   (10U)
#define PCA9422_VBAT_REG(_volt) (((_volt) - PCA9422_VBAT_REG_MIN) / PCA9422_VBAT_REG_STEP)

/*! @brief PCA9422 fast charge current default value definition. */
#define PCA9422_I_FAST_CHG_DFT (0x27U) /* 100mA */

/*! @brief PCA9422 Recharge threshold definition. */
typedef enum _pca9422_recharge_th
{
    kPCA9422_RechargeTh100mV = 0x00U, /* Recharge threshold based on VBAT <= VBAT_REG - 100mV */
    kPCA9422_RechargeTh150mV = 0x10U, /* Recharge threshold based on VBAT <= VBAT_REG - 150mV */
    kPCA9422_RechargeTh200mV = 0x20U, /* Recharge threshold based on VBAT <= VBAT_REG - 200mV */
} pca9422_recharge_th_t;

/*! @brief PCA9422 Top-off current definition. */
typedef enum _pca9422_topoff_i
{
    kPCA9422_TopoffI2p5percent  = 0x00U, /* Topoff current is 2.5% of Fast charge current. */
    kPCA9422_TopoffI5p0percent  = 0x04U, /* Topoff current is 5.0% of Fast charge current. */
    kPCA9422_TopoffI7p5percent  = 0x08U, /* Topoff current is 7.5% of Fast charge current. */
    kPCA9422_TopoffI10p0percent = 0x0CU, /* Topoff current is 10.0% of Fast charge current. */
} pca9422_topoff_i_t;

/*! @brief PCA9422 Precharge timer definition. */
typedef enum _pca9422_precharge_timer
{
    kPCA9422_PrechgTimerDisable = 0x00U, /* Precharge timer is disabled. */
    kPCA9422_PrechgTimer15min   = 0x01U, /* Precharge timer set 15min. */
    kPCA9422_PrechgTimer30min   = 0x02U, /* Precharge timer set 30min. */
    kPCA9422_PrechgTimer60min   = 0x03U, /* Precharge timer set 60min. */
} pca9422_precharge_timer_t;

/*! @brief PCA9422 charger control 5 register default value definition. */
#define PCA9422_CHARGER_CNTL_5_DFT (0x41U) /* Enable THERM function */

/*! @brief PCA9422 V_HOT_60C threshold definition. */
typedef enum _pca9422_v_hot_60c
{
    kPCA9422_Vhot60C32p63percent = 0x00U, /* Vhot threshold is 32.63% of VTHREM_BIAS. */
    kPCA9422_Vhot60C29p07percent = 0x40U, /* Vhot threshold is 29.07% of VTHREM_BIAS. */
    kPCA9422_Vhot60C25p84percent = 0x80U, /* Vhot threshold is 25.84% of VTHREM_BIAS. */
    kPCA9422_Vhot60C22p94percent = 0xC0U, /* Vhot threshold is 22.94% of VTHREM_BIAS. */
} pca9422_v_hot_60c_t;

