solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pca9422/fsl_pca9422.h
/*! @brief PCA9422 V_COOL_10C threshold definition. */
typedef enum _pca9422_v_cool_10c
{
    kPCA9422_Vcool10C74p18percent = 0x00U, /* Vcool threshold is 74.18% of VTHREM_BIAS. */
    kPCA9422_Vcool10C69p62percent = 0x04U, /* Vcool threshold is 69.62% of VTHREM_BIAS. */
    kPCA9422_Vcool10C64p82percent = 0x08U, /* Vcool threshold is 64.82% of VTHREM_BIAS. */
    kPCA9422_Vcool10C59p87percent = 0x0CU, /* Vcool threshold is 59.87% of VTHREM_BIAS. */
} pca9422_v_cool_10c_t;

/*! @brief PCA9422 V_COLD_0C threshold definition. */
typedef enum _pca9422_v_cold_0c
{
    kPCA9422_Vcold0C82p26percent = 0x00U, /* Vcold threshold is 82.26% of VTHREM_BIAS. */
    kPCA9422_Vcold0C78p42percent = 0x01U, /* Vcold threshold is 78.42% of VTHREM_BIAS. */
    kPCA9422_Vcold0C74p18percent = 0x02U, /* Vcold threshold is 74.18% of VTHREM_BIAS. */
    kPCA9422_Vcold0C69p62percent = 0x03U, /* Vcold threshold is 69.62% of VTHREM_BIAS. */
} pca9422_v_cold_0c_t;

/*! @brief PCA9422 Fast charge timer definition. */
typedef enum _pca9422_fast_chg_timer
{
    kPCA9422_FastchgTimerDisable = 0x00U, /* Fast charge timer is disabled */
    kPCA9422_FastchgTimer3h      = 0x40U, /* Fast charge timer set 3 hours */
    kPCA9422_FastchgTimer5h      = 0x80U, /* Fast charge timer set 5 hours */
    kPCA9422_FastchgTimer7h      = 0xC0U, /* Fast charge timer set 7 hours */
} pca9422_fast_chg_timer_t;

/*! @brief PCA9422 New charge current at COOL(10C) condition definition. */
typedef enum _pca9422_new_i_vbat_10c
{
    kPCA9422_NewIVbat10C_StayIFastchg = 0x00U, /* Stays a current IFAST_CHG */
    kPCA9422_NewIVbat10C_0p75IFastchg = 0x04U, /* Set [2.5mA or 5.0mA + 0.75 *I_FAST_CHG[6:0] x 2.5mA or 5.0mA] */
    kPCA9422_NewIVbat10C_0p50IFastchg = 0x08U, /* Set [2.5mA or 5.0mA + 0.50 *I_FAST_CHG[6:0] x 2.5mA or 5.0mA] */
    kPCA9422_NewIVbat10C_0p25IFastchg = 0x0CU, /* Set [2.5mA or 5.0mA + 0.25 *I_FAST_CHG[6:0] x 2.5mA or 5.0mA] */
} pca9422_new_i_vbat_10c_t;

/*! @brief PCA9422 New charge current at WARM Plus(50C) condition definition. */
typedef enum _pca9422_new_i_vbat_50c
{
    kPCA9422_NewIVbat50C_StayIFastchg = 0x00U, /* Stays a current IFAST_CHG */
    kPCA9422_NewIVbat50C_0p75IFastchg = 0x10U, /* Set [2.5mA or 5.0mA + 0.75 *I_FAST_CHG[6:0] x 2.5mA or 5.0mA] */
    kPCA9422_NewIVbat50C_0p50IFastchg = 0x20U, /* Set [2.5mA or 5.0mA + 0.50 *I_FAST_CHG[6:0] x 2.5mA or 5.0mA] */
    kPCA9422_NewIVbat50C_0p25IFastchg = 0x30U, /* Set [2.5mA or 5.0mA + 0.25 *I_FAST_CHG[6:0] x 2.5mA or 5.0mA] */
} pca9422_new_i_vbat_50c_t;

/*! @brief PCA9422 New charge current at WARM(45C) condition definition. */
typedef enum _pca9422_new_i_vbat_45c
{
    kPCA9422_NewIVbat45C_StayIFastchg = 0x00U, /* Stays a current IFAST_CHG */
    kPCA9422_NewIVbat45C_0p75IFastchg = 0x04U, /* Set [2.5mA or 5.0mA + 0.75 *I_FAST_CHG[6:0] x 2.5mA or 5.0mA] */
    kPCA9422_NewIVbat45C_0p50IFastchg = 0x08U, /* Set [2.5mA or 5.0mA + 0.50 *I_FAST_CHG[6:0] x 2.5mA or 5.0mA] */
    kPCA9422_NewIVbat45C_0p25IFastchg = 0x0CU, /* Set [2.5mA or 5.0mA + 0.25 *I_FAST_CHG[6:0] x 2.5mA or 5.0mA] */
} pca9422_new_i_vbat_45c_t;

/*! @brief PCA9422 New VBAT_REG at WARM condition, WARM_45C or WARM_50C, definition. */
typedef enum _pca9422_new_vbat_45c
{
    kPCA9422_NewVbat45C_StayVbatReg       = 0x00U, /* Stays a current VVBAT_REG */
    kPCA9422_NewVbat45C_VbatRegMinus100mV = 0x01U, /* Set a new value with (VVBAT_REG – 100mV) */
    kPCA9422_NewVbat45C_VbatRegMinus150mV = 0x02U, /* Set a new value with (VVBAT_REG – 150mV) */
    kPCA9422_NewVbat45C_VbatRegMinus200mV = 0x03U, /* Set a new value with (VVBAT_REG – 200mV) */
} pca9422_new_vbat_45c_t;

/*! @brief PCA9422 New VBAT_REG at WARM condition, WARM_45C or WARM_50C, definition. */
typedef enum _pca9422_new_vbat_50c
{
    kPCA9422_NewVbat50C_StayVbatReg       = 0x00U, /* Stays a current VVBAT_REG */
    kPCA9422_NewVbat50C_VbatRegMinus100mV = 0x40U, /* Set a new value with (VVBAT_REG – 100mV) */
    kPCA9422_NewVbat50C_VbatRegMinus150mV = 0x80U, /* Set a new value with (VVBAT_REG – 150mV) */
    kPCA9422_NewVbat50C_VbatRegMinus200mV = 0xC0U, /* Set a new value with (VVBAT_REG – 200mV) */
} pca9422_new_vbat_50c_t;

/*! @brief PCA9422 thermal regulation threshold definition. */
typedef enum _pca9422_thermal_reg
{
    kPCA9422_ThermalRegulationDisable = 0x00U, /* Thermal regulation threshold is disabled */
    kPCA9422_ThermalRegulation60C     = 0x08U, /* Thermal regulation threshuold is 60C */
    kPCA9422_ThermalRegulation70C     = 0x10U, /* Thermal regulation threshuold is 70C */
    kPCA9422_ThermalRegulation80C     = 0x18U, /* Thermal regulation threshuold is 80C */
    kPCA9422_ThermalRegulation90C     = 0x20U, /* Thermal regulation threshuold is 90C */
    kPCA9422_ThermalRegulation100C    = 0x28U, /* Thermal regulation threshuold is 100C */
} pca9422_thermal_regulation_t;

/*! @brief PCA9422 Top-off timer definition. */
typedef enum _pca9422_top_off_timer
{
    kPCA9422_TopoffTimerDisable = 0x00U,
    kPCA9422_TopoffTimer5min    = 0x01U,
    kPCA9422_TopoffTimer10min   = 0x02U,
    kPCA9422_TopoffTimer15min   = 0x03U,
    kPCA9422_TopoffTimer20min   = 0x04U,
    kPCA9422_TopoffTimer25min   = 0x05U,
    kPCA9422_TopoffTimer30min   = 0x06U,
    kPCA9422_TopoffTimer35min   = 0x07U,
} pca9422_top_off_timer_t;

/*! @brief PCA9422 AMUX wait time definition. */
typedef enum _pca9422_amux_auto_off_wait
{
    kPCA9422_AMUXAutoOffWait_256us   = 0x00U,
    kPCA9422_AMUXAutoOffWait_1088us  = 0x40U,
    kPCA9422_AMUXAutoOffWait_8192us  = 0x80U,
    kPCA9422_AMUXAutoOffWait_32768us = 0xC0U,
} pca9422_amux_auto_off_wait_t;

/*! @brief PCA9422 AMUX mode definition. */
typedef enum _pca9422_amux_mode
{
    kPCA9422_AMUXModeManual      = 0x00U,
    kPCA9422_AMUXModeAutoOneshot = 0x20U,
} pca9422_amux_mode_t;

/*! @brief PCA9422 AMUX VBAT/VSYS channel scale factor definition. */
typedef enum _pca9422_amux_vbat_vsys_gain
{
    kPCA9422_AMUXVbatVsysGain_1dvd3 = 0x00U, /* 1/3 */
    kPCA9422_AMUXVbatVsysGain_1dvd4 = 0x10U, /* 1/4 */
} pca9422_amux_vbat_vsys_gain_t;

