solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pca9422/fsl_pca9422.h
/*! @brief PCA9422 AMUX THERM and THERM_BIAS channel scale factor definition. */
typedef enum _pca9422_amux_therm_gain
{
    kPCA9422_AMUXThermGain_1       = 0x00U, /* 1 */
    kPCA9422_AMUXThermGain_1dvd1p5 = 0x08U, /* 1/1.5 */
} pca9422_amux_therm_gain_t;

/* @brief PCA9422 AMUX channel definition. */
typedef enum _pca9422_amux_channel
{
    kPCA9422_AMUXChannel_Off       = 0x00U,
    kPCA9422_AMUXChannel_Vbat      = 0x01U,
    kPCA9422_AMUXChannel_Therm     = 0x02U,
    kPCA9422_AMUXChannel_ThermBias = 0x03U,
    kPCA9422_AMUXChannel_Vsys      = 0x04U,
    kPCA9422_AMUXChannel_Vin       = 0x05U,
    kPCA9422_AMUXChannel_Max       = 0x06U,
} pca9422_amux_channel_t;

/* @brief PCA9422 AMUX configuration structure definition */
typedef struct _pca9422_amux_config
{
    /* AMUX wait time to be automatically disabled in automatic one-shot mode. */
    uint8_t waitTime;
    /* AMUX mode */
    uint8_t amuxMode;
    /* VBAT/VSYS channel scale factor */
    uint8_t vbatGain;
    /* THERM and THERM_BIAS channels scale factor */
    uint8_t thermGain;
    /* AMUX channel */
    uint8_t amuxChannel;
} pca9422_amux_config_t;

/*! @brief PCA9422 Regulator */
/*! @brief PCA9422 Regulator Status definition. */
typedef enum _pca9422_reg_status
{
    kPCA9422_RegStatusVoutSw1OK  = 0x80U, /* SW1 VOUT Power good status */
    kPCA9422_RegStatusVoutSw2OK  = 0x40U, /* SW2 VOUT Power good status */
    kPCA9422_RegStatusVoutSw3OK  = 0x20U, /* SW3 VOUT Power good status */
    kPCA9422_RegStatusVoutSw4OK  = 0x10U, /* SW4 VOUT Power good status */
    kPCA9422_RegStatusVoutLdo1OK = 0x08U, /* LDO1 VOUT Power good status */
    kPCA9422_RegStatusVoutLdo2OK = 0x04U, /* LDO2 VOUT Power good status */
    kPCA9422_RegStatusVoutLdo3OK = 0x02U, /* LDO3 VOUT Power good status */
    kPCA9422_RegStatusVoutLdo4OK = 0x01U, /* LDO4 VOUT Power good status */
} pca9422_reg_status_t;

/*! @brief PCA9422 Power mode definition. */
typedef enum _pca9422_power_mode
{
    kPCA9422_ActiveModeDVS0 = 0x00U, /* Active mode - DVS0 */
    kPCA9422_ActiveModeDVS1 = 0x01U, /* Active mode - DVS1 */
    kPCA9422_ActiveModeDVS2 = 0x02U, /* Active mode - DVS2 */
    kPCA9422_ActiveModeDVS3 = 0x03U, /* Active mode - DVS3 */
    kPCA9422_ActiveModeDVS4 = 0x04U, /* Active mode - DVS4 */
    kPCA9422_ActiveModeDVS5 = 0x05U, /* Active mode - DVS5 */
    kPCA9422_ActiveModeDVS6 = 0x06U, /* Active mode - DVS6 */
    kPCA9422_ActiveModeDVS7 = 0x07U, /* Active mode - DVS7 */
    kPCA9422_StandbyMode    = 0x08U, /* STANDBY mode */
    kPCA9422_NoneMode       = 0x09U, /* None mode */
    kPCA9422_DPStandbyMode  = 0x0AU, /* DPSTANDBY mode */
    kPCA9422_SleepMode      = 0x0BU, /* SLEEP mode */
    kPCA9422_PowerModeMax   = 0x0CU, /* Max Power mode */
} pca9422_power_mode_t;

/*! @brief PCA9422 Standby control definition */
typedef enum _pca9422_standby_ctrl
{
    kPCA9422_StandbyCtrlPins                = 0x00U,
    kPCA9422_StandbyCtrlStandbyConfigandPin = 0x40U,
} pca9422_standby_ctrl_t;

/*! @brief PCA9422 Standby configuration definition */
typedef enum _pca9422_standby_cfg
{
    kPCA9422_StandbyCfgStandby   = 0x00U,
    kPCA9422_StandbyCfgDPStandby = 0x20U,
} pca9422_standby_cfg_t;

/*! @brief PCA9422 DVS_CTRL2 pin enable definition */
typedef enum _pca9422_dvs_ctrl2_en
{
    kPCA9422_DVSCtrl2PinIgnore     = 0x00U,
    kPCA9422_DVSCtrl2PinUseDVSCtrl = 0x04U,
} pca9422_dvs_ctrl2_en_t;

/*! @brief PCA9422 Power Save mode definition */
typedef enum _pca9422_power_save_mode
{
    kPCA9422_PowerSaveUseLowIq         = 0x00U,
    kPCA9422_PowerSaveStandbyDPStandby = 0x10U,
    kPCA9422_PowerSaveDPStandby        = 0x20U,
    kPCA9422_PowerSaveNormal           = 0x30U,
} pca9422_power_save_mode_t;

/*! @brief PCA9422 GPIO pull-up configuration definition */
typedef enum _pca9422_gpio_pullup_cfg
{
    kPCA9422_GPIOPullupVsys = 0x00U,
    kPCA9422_GPIOPullupLDO1 = 0x08U,
} pca9422_gpio_pullup_cfg_t;

/*! @brief PCA9422 VSYS UVLO threshold definition */
typedef enum _pca9422_vsys_uvlo_sel
{
    kPCA9422_VsysUVLOSel2p6V = 0x00U,
    kPCA9422_VsysUVLOSel2p7V = 0x01U,
    kPCA9422_VsysUVLOSel2p8V = 0x02U,
} pca9422_vsys_uvlo_sel_t;

/*! @brief PCA9422 DVS smart mode configuration definition */
typedef enum _pca9422_smart_mode
{
    kPCA9422_SmartModeDisabled = 0x00U,
    kPCA9422_SmartModeEnabled  = 0x04U,
} pca9422_smart_mode_t;

/*! @brief PCA9422 Run state definition. */
typedef enum _pca9422_run_state
{
    kPCA9422_RunStateActiveMode    = 0x00U,
    kPCA9422_RunStateSleepMode     = 0x01U,
    kPCA9422_RunStateStandbyMode   = 0x02U,
    kPCA9422_RunStateDPStandbyMode = 0x03U,
} pca9422_run_state_t;

/*! @brief PCA9422 Regulator definition. */
typedef enum _pca9422_regulator
{
    kPCA9422_RegulatorSwitch1 = 0x80U, /* Switch1 regulator. */
    kPCA9422_RegulatorSwitch2 = 0x40U, /* Switch2 regulator. */
    kPCA9422_RegulatorSwitch3 = 0x20U, /* Switch3 regulator. */
    kPCA9422_RegulatorSwitch4 = 0x10U, /* Switch4 regulator. */
    kPCA9422_RegulatorLdo1    = 0x08U, /* LDO1 regulator. */
    kPCA9422_RegulatorLdo2    = 0x04U, /* LDO2 regulator. */
    kPCA9422_RegulatorLdo3    = 0x02U, /* LDO3 regulator. */
    kPCA9422_RegulatorLdo4    = 0x01U, /* LDO4 regulator. */
} pca9422_regulator_t;

/*! @brief PCA9422 Regulator Enable mode definition. */
typedef enum _pca9422_enmode
{
    kPCA9422_EnmodeOnAll                = 0x00U,
    kPCA9422_EnmodeOnActiveSleepStandby = 0x01U,
    kPCA9422_EnmodeOnActiveSleep        = 0x02U,
    kPCA9422_EnmodeOnActive             = 0x03U,
} pca9422_enmode_t;

/*! @brief PCA9422 Buck DVS control definition. */
enum _pca9422_bx_dvs_ctrl
{
    kPCA9422_DVS0thrI2CInActiveAndSleep = 0x00U, /* BUCKxOUT_DVS0 Reg through I2C in both ACTIVE and SLEEP modes */
    kPCA9422_DVS0thrI2CInAcitveAndBxOUTSLEEPInSleep =
        0x01U, /* BUCKxOUT_DVS0 Reg through I2C in ACTIVE mode, and BUCKxOUT_SLEEP when in SLEEP mode */
    kPCA9422_PinInActiveAndBxOUTSLEEPInSleep =
        0x02U, /* DVS_CTRL[2:0] pins in ACTIVE mode and BUCKxOUT_SLEEP when in SLEEP mode */
    kPCA9422_DVS0thrI2CInAcitveAndPinInSleep =
        0x03U, /* BUCKxOUT_DVS0 Reg through I2C in ACTIVE mode, and DVS_CTRL[2:0] pins when in SLEEP mode */
};

/*! @brief PCA9422 Buck DVS Ramp definition. */
typedef enum _pca9422_bx_ramp
{
    kPCA9422_BxRamp_25mVp1us = 0x00U,
    kPCA9422_BxRamp_25mVp2us = 0x40U,
    kPCA9422_BxRamp_25mVp4us = 0x80U,
    kPCA9422_BxRamp_25mVp8us = 0xC0U,
} pca9422_bx_ramp_t;

/*! @brief PCA9422 Buck power mode definition. */
typedef enum _pca9422_bx_lpmode
{
    kPCA9422_BxLPmodeNormal             = 0x00U, /* Normal mode */
    kPCA9422_BxLPmodeAtStandbyDPStandby = 0x10U, /* Low power mode at STANDBY mode and DPSTANDBY mode */
    kPCA9422_BxLPmodeAtDPStandby        = 0x20U, /* Low power mode at DPSTANDBY mode */
    kPCA9422_BxLPmodeForcedLPM          = 0x30U, /* Forced low power mode */
} pca9422_bx_lpmode_t;

/*! @brief PCA9422 Buck Active Discharge definition. */
typedef enum _pca9422_bx_ad
{
    kPCA9422_BxADDisabled = 0x00U,
    kPCA9422_BxADEnabled  = 0x08U,
} pca9422_bx_ad_t;

/*! @brief PCA9422 Buck Forced PWM definition. */
typedef enum _pca9422_bx_fpwm_mode
{
    kPCA9422_BxAutoPFMandPWM = 0x00U,
    kPCA9422_BxForcedPWM     = 0x04U,
} pca9422_bx_fpwm_mode_t;

/*! @brief PCA9422 Buck1 OUT voltage definition. (uV unit) */
#define PCA9422_BUCK1_OUT_MIN  (400000U)  /* 400mV */
#define PCA9422_BUCK1_OUT_STEP (6250UL)   /* 6.25mV */
#define PCA9422_BUCK1_OUT_MAX  (1975000U) /* 1975mV */
#define PCA9422_BUCK1_OUT_VAL(_volt) \
    (((_volt) - PCA9422_BUCK1_OUT_MIN + PCA9422_BUCK1_OUT_STEP - 1U) / PCA9422_BUCK1_OUT_STEP)
#define PCA9422_BUCK1_OUT_VOLT(_val) (((_val) * PCA9422_BUCK1_OUT_STEP) + PCA9422_BUCK1_OUT_MIN)

/*! @brief PCA9422 Buck2 OUT voltage definition. (uV unit) */
#define PCA9422_BUCK2_OUT_MIN  (400000U)  /* 400mV */
#define PCA9422_BUCK2_OUT_STEP (25000U)   /* 25mV */
#define PCA9422_BUCK2_OUT_MAX  (3400000U) /* 3400mV */
#define PCA9422_BUCK2_OUT_VAL(_volt) \
    (((_volt) - PCA9422_BUCK2_OUT_MIN + PCA9422_BUCK2_OUT_STEP - 1U) / PCA9422_BUCK2_OUT_STEP)
#define PCA9422_BUCK2_OUT_VOLT(_val) (((_val) * PCA9422_BUCK2_OUT_STEP) + PCA9422_BUCK2_OUT_MIN)

/*! @brief PCA9422 Buck3 OUT voltage definition. (uV unit) */
#define PCA9422_BUCK3_OUT_MIN  (400000U)  /* 400mV */
#define PCA9422_BUCK3_OUT_STEP (6250UL)   /* 6.25mV */
#define PCA9422_BUCK3_OUT_MAX  (1975000U) /* 1975mV */
#define PCA9422_BUCK3_OUT_VAL(_volt) \
    (((_volt) - PCA9422_BUCK3_OUT_MIN + PCA9422_BUCK3_OUT_STEP - 1U) / PCA9422_BUCK3_OUT_STEP)
#define PCA9422_BUCK3_OUT_VOLT(_val) (((_val) * PCA9422_BUCK3_OUT_STEP) + PCA9422_BUCK3_OUT_MIN)

/*! @brief PCA9422 LDO2/3 output capacitor selection definition. */
typedef enum _pca9422_ldo23_csel
{
    kPCA9422_LDO23CoutLess5uF       = 0x00U, /* Setting for Cout < 5uF */
    kPCA9422_LDO23CoutHigh5uF       = 0x40U, /* Setting for Cout > 5uF */
    kPCA9422_LDO23AutoCoutDetection = 0x80U, /* Auto Cout detection */
} pca9422_ldo23_csel_t;

/*! @brief PCA9422 LDO2/3 output trace resistance compensation definition. */
typedef enum _pca9422_ldo23_llsel
{
    kPCA9422_LDO23LLSelNoComp = 0x00U, /* No Compensation */
    kPCA9422_LDO23LLSel15mOhm = 0x10U, /* 15mOhm */
    kPCA9422_LDO23LLSel30mOhm = 0x20U, /* 30mOhm */
    kPCA9422_LDO23LLSel45mOhm = 0x30U, /* 45mOhm */
} pca9422_ldo23_llsel_t;

/*! @brief PCA9422 LDO2/3 power mode definition. */
typedef enum _pca9422_ldo23_lpmode
{
    kPCA9422_LDO23LPmodeAtRunState         = 0x00U,
    kPCA9422_LDO23LPmodeAtStandbyDPStandby = 0x04U,
    kPCA9422_LDO23LPmodeAtDPStandby        = 0x08U,
    kPCA9422_LDO23LPmodeNormal             = 0x0CU,
} pca9422_ldo23_lpmode_t;

/*! @brief PCA9422 LDO2/3 Load Switch mode definition. */
typedef enum _pca9422_ldo23_mode
{
    kPCA9422_LDO23LDOMode        = 0x00U,
    kPCA9422_LDO23LoadSwitchMode = 0x01U,
} pca9422_ldo23_mode_t;

/*! @brief PCA9422 LDO1 OUT voltage definition. (uV unit) */
#define PCA9422_LDO1_OUT_MIN  (800000U)  /* 800mV */
#define PCA9422_LDO1_OUT_STEP (25000U)   /* 25mV */
#define PCA9422_LDO1_OUT_MAX  (3000000U) /* 3000mV */
#define PCA9422_LDO1_OUT_VAL(_volt) \
    (((_volt) - PCA9422_LDO1_OUT_MIN + PCA9422_LDO1_OUT_STEP - 1U) / PCA9422_LDO1_OUT_STEP)
#define PCA9422_LDO1_OUT_VOLT(_val) (((_val) * PCA9422_LDO1_OUT_STEP) + PCA9422_LDO1_OUT_MIN)

/*! @brief PCA9422 LDO2/3 OUT voltage definition. (uV unit) */
#define PCA9422_LDO23_OUT_MIN  (500000U)  /* 500mV */
#define PCA9422_LDO23_OUT_STEP (25000U)   /* 25mV */
#define PCA9422_LDO23_OUT_MAX  (1950000U) /* 1950mV */
#define PCA9422_LDO23_OUT_VAL(_volt) \
    (((_volt) - PCA9422_LDO23_OUT_MIN + PCA9422_LDO23_OUT_STEP - 1U) / PCA9422_LDO23_OUT_STEP)
#define PCA9422_LDO23_OUT_VOLT(_val) (((_val) * PCA9422_LDO23_OUT_STEP) + PCA9422_LDO23_OUT_MIN)

