solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pca9422/fsl_pca9422.h
/*! @brief PCA9422 LDO4 OUT voltage definition. (uV unit) */
#define PCA9422_LDO4_OUT_MIN  (800000U)  /* 800mV */
#define PCA9422_LDO4_OUT_STEP (25000U)   /* 25mV */
#define PCA9422_LDO4_OUT_MAX  (3300000U) /* 3300mV */
#define PCA9422_LDO4_OUT_VAL(_volt) \
    (((_volt) - PCA9422_LDO4_OUT_MIN + PCA9422_LDO4_OUT_STEP - 1U) / PCA9422_LDO4_OUT_STEP)
#define PCA9422_LDO4_OUT_VOLT(_val) (((_val) * PCA9422_LDO4_OUT_STEP) + PCA9422_LDO4_OUT_MIN)

/*! @brief PCA9422 Buck-Boost FPWM mode definition. */
typedef enum _pca9422_bb_fpwm_mode
{
    kPCA9422_BBAutoPFMandPWM = 0x00U, /* Automatic PFM and PWM mode transition */
    kPCA9422_BBForcedPWM     = 0x08U, /* Forced PWM mode */
} pca9422_bb_fpwm_mode_t;

/*! @brief PCA9422 Buck-Boost overcurrent response definition. */
typedef enum _pca9422_bb_fault_oc_ctrl
{
    kPCA9422_BBNotTurnOff = 0x00U,
    kPCA9422_BBTurnOff    = 0x04U,
} pca9422_bb_fault_oc_ctrl_t;

/*! @brief PCA9422 Buck-Boost active discharge control definition. */
typedef enum _pca9422_bb_soft_stdn
{
    kPCA9422_BBRampDownDisabled = 0x00U, /* Digital ramping down Vout is disabled */
    kPCA9422_BBRampDownEnabled  = 0x02U, /* Digital ramping down Vout is enabled */
} pca9422_bb_soft_stdn_t;

/*! @brief PCA9422 Buck-Boost passive discharge control definition. */
typedef enum _pca9422_bb_dis
{
    kPCA9422_BBPassiveDsgDisabled = 0x00U,
    kPCA9422_BBPassiveDsgEnabled  = 0x01U,
} pca9422_bb_dis_t;

/*! @brief PCA9422 Buck-Boost enable in RUN state definition. */
typedef enum _pca9422_bb_enable_in_run
{
    kPCA9422_BBOffInRunState = 0x00U,
    kPCA9422_BBOnInRunState  = 0x40U,
} pca9422_bb_enable_in_run_t;

/*! @brief PCA9422 Buck-Boost operation mode definition. */
typedef enum _pca9422_bb_mode
{
    kPCA9422_BBOPmodeAuto            = 0x00U, /* Auto */
    kPCA9422_BBOPmodeForcedBoostOnly = 0x10U, /* Forced BOOST only */
    kPCA9422_BBOPmodeForcedBuckOnly  = 0x20U, /* Forced BUCK only */
} pca9422_bb_mode_t;

/*! @brief PCA9422 Buck-Boost Enable mode definition. */
typedef enum _pca9422_bb_enmode
{
    kPCA9422_BBEnmodeOnAll                = 0x00U,
    kPCA9422_BBEnmodeOnActiveSleepStandby = 0x04U,
    kPCA9422_BBEnmodeOnActiveSleep        = 0x08U,
    kPCA9422_BBEnmodeOnActive             = 0x0CU,
} pca9422_bb_enmode_t;

/*! @brief PCA9422 Buck-Boost power mode definition. */
typedef enum _pca9422_bb_lpmode
{
    kPCA9422_BBLPmodeNormal             = 0x00U,
    kPCA9422_BBLPmodeAtStandbyDPStandby = 0x01U,
    kPCA9422_BBLPmodeAtDPStandby        = 0x02U,
    kPCA9422_BBLPmodeForcedLPM          = 0x03U,
} pca9422_bb_lpmode_t;

/*! @brief PCA9422 Regulator power mode definition. */
typedef enum _pca9422_reg_lpmode
{
    kPCA9422_LPmodeNormal             = 0x00U,
    kPCA9422_LPmodeAtStandbyDPStandby = 0x01U,
    kPCA9422_LPpmodeAtDPstandby       = 0x02U,
    kPCA9422_LPmodeForcedLPM          = 0x03U,
} pca9422_reg_lpmode_t;

/*! @brief PCA9422 Buck-Boost OUT voltage definition. (uV unit) */
#define PCA9422_BB_OUT_MIN        (1800000U) /* 1800mV */
#define PCA9422_BB_OUT_STEP       (25000U)   /* 25mV */
#define PCA9422_BB_OUT_MAX        (5000000U) /* 5000mV */
#define PCA9422_BB_OUT_VAL(_volt) (((_volt) - PCA9422_BB_OUT_MIN + PCA9422_BB_OUT_STEP - 1U) / PCA9422_BB_OUT_STEP)
#define PCA9422_BB_OUT_VOLT(_val) (((_val) * PCA9422_BB_OUT_STEP) + PCA9422_BB_OUT_MIN)

/*! @brief PCA9422 Regulator Voltage definition. */
typedef enum _pca9422_vout
{
    kPCA9422_RegVout        = 0x00U,
    kPCA9422_RegSleepVout   = 0x01U,
    kPCA9422_RegStandbyVout = 0x02U,
    kPCA9422_SWMaxVout      = 0x03U,
    kPCA9422_BBMinVout      = 0x04U,
    kPCA9422_SWDVS0Vout     = 0x05U,
    kPCA9422_SWDVS1Vout     = 0x06U,
    kPCA9422_SWDVS2Vout     = 0x07U,
    kPCA9422_SWDVS3Vout     = 0x08U,
    kPCA9422_SWDVS4Vout     = 0x09U,
    kPCA9422_SWDVS5Vout     = 0x0AU,
    kPCA9422_SWDVS6Vout     = 0x0BU,
    kPCA9422_SWDVS7Vout     = 0x0CU,
} pca9422_vout_t;

/*! @brief PCA9422 LED enable definition. */
typedef enum _pca9422_led_en
{
    kPCA9422_LedEnDisable = 0x00U,
    kPCA9422_LedEnEnable  = 0x80U,
} pca9422_led_en_t;

/*! @brief PCA9422 LED control definition. */
typedef enum _pca9422_led_ovrd
{
    kPCA9422_LedControlByStateMachine = 0x00U,
    kPCA9422_LedControlBySoftware     = 0x20U,
} pca9422_led_ovrd_t;

/*! @brief PCA9422 Output voltage configuration lock definition. */
typedef enum _pca9422_reg_lock
{
    kPCA9422_RegLockUnlockKey = 0x5CU,
    kPCA9422_RegLockLockKey   = 0x00U,
} pca9422_reg_lock_t;

/*! @brief PCA9422 Mode Configuration definition. - Power Mode Setting Voltage */
typedef struct _pca9422_modecfg
{
    uint32_t sw1OutVolt;  /* uV */
    uint32_t sw2OutVolt;  /* uV */
    uint32_t sw3OutVolt;  /* uV */
    uint32_t sw4OutVolt;  /* uV */
    uint32_t ldo1OutVolt; /* uV */
    uint32_t ldo2OutVolt; /* uV */
    uint32_t ldo3OutVolt; /* uV */
    uint32_t ldo4OutVolt; /* uV */
} pca9422_modecfg_t;

/*! @brief PCA9422 Enmode Configuration definition */
typedef struct _pca9422_enmodecfg
{
    pca9422_enmode_t sw1OutEnMode;
    pca9422_enmode_t sw2OutEnMode;
    pca9422_enmode_t sw3OutEnMode;
    pca9422_enmode_t sw4OutEnMode;
    pca9422_enmode_t ldo1OutEnMode;
    pca9422_enmode_t ldo2OutEnMode;
    pca9422_enmode_t ldo3OutEnMode;
    pca9422_enmode_t ldo4OutEnMode;
} pca9422_enmodecfg_t;

/*! @brief PCA9422 Enable configuration definition */
typedef struct _pca9422_enablecfg
{
    bool enableSw1Out;
    bool enableSw2Out;
    bool enableSw3Out;
    bool enableSw4Out;
    bool enableLdo1Out;
    bool enableLdo2Out;
    bool enableLdo3Out;
    bool enableLdo4Out;
} pca9422_enablecfg_t;

/*! @brief PCA9422 Regulator Enable in RUN state definition */
typedef struct _pca9422_regultoren
{
    bool sw1Enable;
    bool sw2Enable;
    bool sw3Enable;
    bool sw4Enable;
    bool ldo1Enable;
    bool ldo2Enable;
    bool ldo3Enable;
    bool ldo4Enable;
} pca9422_regulatoren_t;

