solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pca9422/fsl_pca9422.h
/*! @brief PCA9422 Handle definition. */
typedef struct _pca9422_handle
{
    /* Pointer to the user-defined I2C Send Data function. */
    status_t (*I2C_SendFunc)(
        uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, const uint8_t *txBuff, uint8_t txBuffSize);
    /* Pointer to the user-defined I2C Receive Data function. */
    status_t (*I2C_ReceiveFunc)(
        uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, uint8_t *rxBuff, uint8_t rxBuffSize);
    /* The I2C Slave Address Read From OTP. */
    uint8_t slaveAddress;
} pca9422_handle_t;

/*! @brief PCA9422 Configuration Structure definition. */
/*! @brief PCA9422 Charger Configuration Structure definition. */
typedef struct _pca9422_charger_config
{
    /* Pointer to the user-defined I2C Send Data function. */
    status_t (*I2C_SendFunc)(
        uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, const uint8_t *txBuff, uint8_t txBuffSize);
    /* Pointer to the user-defined I2C Receive Data function. */
    status_t (*I2C_ReceiveFunc)(
        uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, uint8_t *rxBuff, uint8_t rxBuffSize);
    /* Charge current */
    /* Precharge current */
    pca9422_prechg_i_t prechgI;
    /* Charging current step */
    pca9422_chg_i_step_t chgIStep;
    /* Top-off current */
    pca9422_topoff_i_t topoffI;
    /* Fast Charge current */
    uint16_t fastI;
    /* Charging voltage */
    /* VBAT float voltage */
    uint16_t vbatReg;
    /* Recharge threshold */
    pca9422_recharge_th_t rechgVolt;
    /* Charging timer */
    /* Precharge timer - refer _pca9422_precharge_timer */
    pca9422_precharge_timer_t prechgTime;
    /* Fast charge timer - refer _pca9422_fast_chg_timer  */
    pca9422_fast_chg_timer_t fastchgTime;
    /* Top-off timer */
    pca9422_top_off_timer_t topoffTime;
    /* JEITA parameters */
    /* Warm voltage threshold - 45C, refer _pca9422_v_warm */
    pca9422_v_warm_45c_t warmVolt;
    /* Warm plus voltage threshold - 50C, refer _pca9422_v_warm */
    pca9422_v_warm_50c_t warmPlusVolt;
    /* Hot voltage threshold - 60C */
    pca9422_v_hot_60c_t hotVolt;
    /* Cool voltage threshold - 10C */
    pca9422_v_cool_10c_t coolVolt;
    /* Cold voltage threshold - 0C */
    pca9422_v_cold_0c_t coldVolt;
    /* New regulation voltage - Warm(45C) */
    pca9422_new_vbat_45c_t warmVbatReg;
    /* New regulation voltage - Warm plus(50C) */
    pca9422_new_vbat_50c_t warmPlusVbatReg;
    /* New Fast charge current - Cold(10C) */
    pca9422_new_i_vbat_10c_t coldIVbat;
    /* New Fast charge current - Warm(45C) */
    pca9422_new_i_vbat_45c_t warmIVbat;
    /* New Fast charge current - Warm plus(50C) */
    pca9422_new_i_vbat_50c_t warmPlusIVbat;
    /* AICL threshold */
    pca9422_aicl_v_t aiclV;
    /* Input current limit */
    pca9422_vin_ilim_t icl;
    /* VSYS regulation voltage */
    uint16_t vsysReg;
    /* AMUX wait time */
    pca9422_amux_auto_off_wait_t amuxWaitTime;
    /* AMUX mode */
    pca9422_amux_mode_t amuxMode;
    /* VBAT/VSYS channel scale factor */
    pca9422_amux_vbat_vsys_gain_t amuxVbatGain;
    /* THERM and THERM_BIAS channels scale factor */
    pca9422_amux_therm_gain_t amuxThermGain;
    /* AMUX channel */
    pca9422_amux_channel_t amuxChannel;
    /* The PCA9422 I2C Slave Address. */
    uint8_t slaveAddress;
} pca9422_charger_config_t;

/*! @brief PCA9422 Regulator Configuration Structure definition. */
/*! @brief PCA9422 Buck Configuration Structure definition. */
typedef struct _pca9422_buck_config
{
    uint8_t dvsUpStep;
    uint8_t dvsDnStep;
    uint8_t dvsCtrl;
    pca9422_bx_ramp_t rampSpeed;
    pca9422_bx_lpmode_t lpMode;
    pca9422_bx_ad_t activeDischg;
    pca9422_bx_fpwm_mode_t fpwmEn;
    pca9422_enmode_t enMode;
    uint32_t dvsVout[8];
    uint32_t stbyVout;
    uint32_t maxVout;
    uint32_t sleepVout;
} pca9422_buck_config_t;

/*! @brief PCA9422 LDO2/3/4 Configuration Structure definition. */
typedef struct _pca9422_ldo234_config
{
    pca9422_ldo23_csel_t cSel;
    pca9422_ldo23_llsel_t llSel;
    pca9422_ldo23_lpmode_t lpMode;
    pca9422_enmode_t enMode;
    pca9422_ldo23_mode_t ldoMode;
    bool activeDischg;
    uint32_t vout;
    uint32_t stbyVout;
    uint32_t sleepVout;
} pca9422_ldo234_config_t;

/*! @brief PCA9422 LDO1 Configuration Structure definition. */
typedef struct _pca9422_ldo1_config
{
    bool activeDischg;
    bool enMode;
    uint32_t vout;
} pca9422_ldo1_config_t;

/*! @brief PCA9422 Buck-Boost Configuration Structure definition. */
typedef struct _pca9422_bb_config
{
    pca9422_bb_fpwm_mode_t fpwmEn;
    pca9422_bb_fault_oc_ctrl_t ocCtrl;
    pca9422_bb_soft_stdn_t softStdn;
    pca9422_bb_dis_t passiveDis;
    pca9422_bb_enable_in_run_t enInRun;
    pca9422_bb_mode_t bbMode;
    pca9422_bb_enmode_t enMode;
    pca9422_bb_lpmode_t lpMode;
    uint32_t vout;
    uint32_t stdyVout;
    uint32_t maxVout;
    uint32_t minVout;
    uint32_t sleepVout;
} pca9422_bb_config_t;

typedef struct _pca9422_regulator_config
{
    /* Pointer to the user-defined I2C Send Data function. */
    status_t (*I2C_SendFunc)(
        uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, const uint8_t *txBuff, uint8_t txBuffSize);
    /* Pointer to the user-defined I2C Receive Data function. */
    status_t (*I2C_ReceiveFunc)(
        uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, uint8_t *rxBuff, uint8_t rxBuffSize);
    /* Standby Control */
    pca9422_standby_ctrl_t standbyCtrl;
    /* Standby configuration bit */
    pca9422_standby_cfg_t standbyCfg;
    /* DVS_CTRL2 pin enable bit */
    pca9422_dvs_ctrl2_en_t dvsCtrl2En;
    /* VSYS UVLO threshold */
    pca9422_vsys_uvlo_sel_t vsysUvlo;
    /* DVS smart mode */
    pca9422_smart_mode_t smartMode;
    /* Buck1/2/3 configuration */
    pca9422_buck_config_t buck[3];
    /* LDO2/3/4 configuration */
    pca9422_ldo234_config_t ldo[3];
    /* LDO1 configuration */
    pca9422_ldo1_config_t ldo1;
    /* Buck-Boost configuration */
    pca9422_bb_config_t buckBoost;
    /* The PCA9422 I2C Slave Address. */
    uint8_t slaveAddress;
} pca9422_regulator_config_t;

/*!
 * @addtogroup pca9422
 * @{
 */

