solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pca9422/fsl_pca9422.h
/*******************************************************************************
 * API
 ******************************************************************************/
#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name Initialization and Control function
 * @{
 */

/*!
 * @brief Gets the default configuration structure for charger.
 *
 * This function initializes the PCA9422 charger configuration structure to default values. The default
 * values are as follows.

 *   config->I2C_SendFunc     = NULL;
 *   config->I2C_ReceiveFunc  = NULL;
 *   config->prechgI          = kPCA9422_PrechgI17percent;
 *   config->chgIStep         = kPCA9422_ChgIStep2p5mA;
 *   config->topoffI          = kPCA9422_TopoffI2p5percent;
 *   config->fastI            = 100U;
 *   config->vbatReg          = 4200U;
 *   config->rechgVolt        = kPCA9422_RechargeTh100mV;
 *   config->prechgTime       = kPCA9422_PrechgTimer30min;
 *   config->fastchgTime      = kPCA9422_FastchgTimer3h;
 *   config->topoffTime       = kPCA9422_TopoffTimer5min;
 *   config->warmVolt         = kPCA9422_Vwarm45C32p63percent;
 *   config->warmPlusVolt     = kPCA9422_Vwarm50C29p07percent;
 *   config->hotVolt          = kPCA9422_Vhot60C22p94percent;
 *   config->coolVolt         = kPCA9422_Vcool10C64p82percent;
 *   config->coldVolt         = kPCA9422_Vcold0C74p18percent;
 *   config->warmVbatReg      = kPCA9422_NewVbat45C_StayVbatReg;
 *   config->warmPlusVbatReg  = kPCA9422_NewVbat50C_StayVbatReg;
 *   config->coldIVbat        = kPCA9422_NewIVbat10C_StayIFastchg;
 *   config->warmIVbat        = kPCA9422_NewIVbat45C_StayIFastchg;
 *   config->warmPlusIVbat    = kPCA9422_NewIVbat50C_StayIFastchg;
 *   config->aiclV            = kPCA9422_AICLV4p5V;
 *   config->icl              = kPCA9422_VinIlim_470mA;
 *   config->vsysReg          = 4550U;
 *   config->amuxWaitTime     = kPCA9422_AMUXAutoOffWait_256us;
 *   config->amuxMode         = kPCA9422_AMUXModeManual;
 *   config->amuxVbatGain     = kPCA9422_AMUXVbatVsysGain_1dvd3;
 *   config->amuxThermGain    = kPCA9422_AMUXThermGain_1;
 *   config->amuxChannel      = kPCA9422_AMUXChannel_Off;
 *   config->slaveAddress     = PCA9422_DEFAULT_I2C_ADDR;
 *
 * @param config Pointer to the PCA9422 configuration structure for charger.
 */
void PCA9422_GetChargerDefaultConfig(pca9422_charger_config_t *config);

/*!
 * @brief Initializes a PCA9422 charger instance.
 *
 * This function initializes the PCA9422 battery charger with user-defined settings.
 * This example shows how to set up the pca9422_config_t parameters and how
 * to call the PCA9422_Init function by passing in these parameters.
 * @code
 *   pca9422_config_t pca9422Config;
 *   PCA9422_GetDefaultConfig(&pca9422Config);
 *   pca9422Config.I2C_SendFunc    = APP_I2C_SendFunc;
 *   pca9422Config.I2C_ReceiveFunc = APP_I2C_ReceiveFunc;
 *   PCA9422_Init(&pca9422Handle, &pca9422Config);
 * @endcode
 *
 * @param handle PCA9422 Handle.
 * @param config Pointer to the user-defined configuration structure.
 */
void PCA9422_InitCharger(pca9422_handle_t *handle, const pca9422_charger_config_t *config);
/* @} */

/*!
 * @brief Set Precharge Current of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @param iPrechg Precharge current(register value).
 * @return true if success or false if error.
 */
bool PCA9422_SetPreChargeCurrent(pca9422_handle_t *handle, uint8_t iPrechg);

/*!
 * @brief Get Precharge Current of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @return Precharge current(register value).
 */
uint8_t PCA9422_GetPreChargeCurrent(pca9422_handle_t *handle);

/*!
 * @brief Get Topoff Current of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @return Topoff current(register value).
 */
uint8_t PCA9422_GetTopoffCurrent(pca9422_handle_t *handle);

/*!
 * @brief Set Topoff Current of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @param iTopoff Topoff current(register value).
 * @return true if success or false if error.
 */
bool PCA9422_SetTopoffCurrent(pca9422_handle_t *handle, uint8_t iTopoff);

/*!
 * @brief Set Fast Charge Current of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @param iFast Fast charge current(mA*10).
 * @return true if success or false if error.
 */
bool PCA9422_SetFastChargeCurrent(pca9422_handle_t *handle, uint16_t iFast);

/*!
 * @brief Get Fast Charge Current of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @return current Fast charge current(mA*10).
 */
uint16_t PCA9422_GetFastChargeCurrent(pca9422_handle_t *handle);

/*!
 * @brief Get Charge Current of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @return current charge current(mA).
 */
uint16_t PCA9422_GetChargeCurrent(pca9422_handle_t *handle);
/*!
 * @brief Get VBAT regulation voltage of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @return vFloat VBAT floating(regulation) voltage(mV).
 */
uint16_t PCA9422_GetVBATRegulation(pca9422_handle_t *handle);

/*!
 * @brief Set VBAT regulation voltage of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @param vFloat VBAT floating(regulation) voltage(mV).
 * @return true if success or false if error.
 */
bool PCA9422_SetVBATRegulation(pca9422_handle_t *handle, uint16_t vFloat);

/*!
 * @brief Set recharge threshold voltage of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @param rechgTh Recharge threshold(register value).
 * @return true if success or false if error.
 */
bool PCA9422_SetRechargeThreshold(pca9422_handle_t *handle, uint8_t rechgTh);

/*!
 * @brief Set precharge timer of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @param tPrechg Precharge Timer(register value).
 * @return true if success or false if error.
 */
bool PCA9422_SetPrechargeTimer(pca9422_handle_t *handle, uint8_t tPrechg);

/*!
 * @brief Set fast charge timer of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @param tFastchg Fast charge Timer(register value).
 * @return true if success or false if error.
 */
bool PCA9422_SetFastchargeTimer(pca9422_handle_t *handle, uint8_t tFastchg);

/*!
 * @brief Set topoff timer of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @param tTopoff Topoff Timer(register value).
 * @return true if success or false if error.
 */
bool PCA9422_SetTopoffTimer(pca9422_handle_t *handle, uint8_t tTopoff);

/*!
 * @brief Get Charge State of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @return charge state.
 *         0 - No charge
 *         0x01 - Charging On (Fast Charge or Prehcarge state)
 *         0x02 - Constant Voltage or Topoff state
 *         0x04 - Charge Done state
 */
uint8_t PCA9422_GetChargeState(pca9422_handle_t *handle);

/*!
 * @brief Select AMUX channel of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @param amuxCh AMUX channel.
 */
void PCA9422_SelectAMUXChannel(pca9422_handle_t *handle, pca9422_amux_channel_t amuxCh);

/*!
 * @brief Set AMUX mode of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @param mode AMUX mode.
 */
void PCA9422_SetAMUXMode(pca9422_handle_t *handle, pca9422_amux_mode_t mode);

/*!
 * @brief Get AMUX mode of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @return AMUX mode if success or 0xFF if error.
 */
pca9422_amux_mode_t PCA9422_GetAMUXMode(pca9422_handle_t *handle);

/*!
 * @brief Set AMUX configuration of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @param config AMUX configuration.
 * @return true if success or false if error.
 */
bool PCA9422_SetAMUXConfig(pca9422_handle_t *handle, pca9422_amux_config_t config);

/*!
 * @brief Get AMUX scale factor for each channel of PCAA9422.
 *
 * @param handle PCA9422 Handle.
 * @param channel AMUX channel.
 * @return scalefactor Scale factor for the channel.
 */
float PCA9422_GetAMUXScaleFactor(pca9422_handle_t *handle, pca9422_amux_channel_t channel);

/*!
 * @brief Set Enable or Disable charge of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @param enable if enable is 1 and disable is 0.
 * @return true if success or false if error.
 */
bool PCA9422_SetEnableCharge(pca9422_handle_t *handle, bool enable);

/*!
 * @brief Set Enable or Disable USB suspend Mode of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @param enable if enable is 1 and disable is 0.
 * @return true if success or false if error.
 */
bool PCA9422_SetUSBSuspendMode(pca9422_handle_t *handle, bool enable);

/*!
 * @name Initialization and Control function for regulators
 * @{
 */
/*!
 * @brief Gets the default configuration structure for regulators.
 *
 * This function initializes the PCA9422 regulator configuration structure to default values. The default
 * values are as follows.
 *
 *   pca9422RegConfig->I2C_SendFunc    = NULL;
 *   pca9422RegConfig->I2C_ReceiveFunc = NULL;
 *   pca9422RegConfig->standbyCtrl     = kPCA9422_StandbyCtrlPins;
 *   pca9422RegConfig->standbyCfg      = kPCA9422_StandbyCfgStandby;
 *   pca9422RegConfig->dvsCtrl2En      = kPCA9422_DVSCtrl2EnIgnore;
 *   pca9422RegConfig->vsysUvlo        = kPCA9422_VsysUvloSel2p7V;
 *   pca9422RegConfig->smartMode       = kPCA9422_SmartModeDisabled;
 *   pca9422RegConfig->buck            = *buck;
 *   pca9422RegConfig->ldo             = *ldo;
 *   pca9422RegConfig->ldo1            = ldo1;
 *   pca9422RegConfig->buckBoost       = buckBoost;
 *   pca9422RegConfig->slaveAddress    = PCA9422_DEFAULT_I2C_ADDR;
 *
 * @param RegConfig Pointer to the PCA9422 configuration structure for regulator.
 */
void PCA9422_GetRegulatorDefaultConfig(pca9422_regulator_config_t *RegConfig);

/*!
 * @brief Gets the device ID
 *
 * This function gets the PCA9422 device ID.
 *
 * @param handle PCA9422 Handle.
 * @return PCA9422 Device ID value.
 */
uint8_t PCA9422_GetDeviceID(pca9422_handle_t *handle);

/*!
 * @brief Initializes a PCA9422 instance.
 *
 * This function initializes the PCA9422 regulator with user-defined settings.
 * This example shows how to set up the pca9422_regulator_config_t parameters and
 * how to call the PCA9422_RegInit function by passing in these parameters.
 * @code
 *   pca9422_regulator_config_t pca9422RegConfig;
 *   PCA9422_GetRegDefaultConfig(&pca9422RegConfig);
 *   pca9422RegConfig.I2C_SendFunc    = APP_I2C_SendFunc;
 *   pca9422RegConfig.I2C_ReceiveFunc = APP_I2C_ReceiveFunc;
 *   PCA9422_RegInit(&pca9422Handle, &pca9422RegConfig);
 * @endcode
 *
 * @param handle PCA9422 Handle.
 * @param config Pointer to the user-defined configuration structure for regulator.
 */
void PCA9422_InitRegulator(pca9422_handle_t *handle, const pca9422_regulator_config_t *config);

/*!
 * @brief Gets the default mode configuration structure.
 *
 * This function initializes the PCA9422 mode configuration structure to default values.
 * The default values are as follows.
 *
 *   config->sw1OutVolt         = 1000000;
 *   config->sw2OutVolt         = 1100000;
 *   config->sw3OutVolt         = 1000000;
 *   config->sw4OutVolt         = 1800000;
 *   config->ldo1OutVolt        = 1800000;
 *   config->ldo2OutVolt        = 1800000;
 *   config->ldo3OutVolt        = 1200000;
 *   config->ldo4OutVolt        = 3300000;
 *
 * @param config Pointer to the PCA9422 mode configuration structure.
 */
void PCA9422_GetDefaultPowerModeConfig(pca9422_modecfg_t *config);

/*!
 * @brief Gets the default enmode configuration structure.
 *
 * This function initializes the PCA9422 enmode configuration structure to default values.
 * The default values are as follows.
 *
 *   enModeCfg->sw1OutEnMode  = kPCA9422_EnmodeOnAll;
 *   enModeCfg->sw2OutEnMode  = kPCA9422_EnmodeOnAll;
 *   enModeCfg->sw3OutEnMode  = kPCA9422_EnmodeOnAll;
 *   enModeCfg->sw4OutEnMode  = kPCA9422_EnmodeOnAll;
 *   enModeCfg->ldo1OutEnMode = kPCA9422_EnmodeOnAll;
 *   enModeCfg->ldo2OutEnMode = kPCA9422_EnmodeOnAll;
 *   enModeCfg->ldo3OutEnMode = kPCA9422_EnmodeOnAll;
 *   enModeCfg->ldo4OutEnMode = kPCA9422_EnmodeOnAll;
 *
 * @param enModeCfg Pointer to the PCA9422 enmode configuration structure.
 */
void PCA9422_GetDefaultEnModeConfig(pca9422_enmodecfg_t *enModeCfg);

/*!
 * @brief Gets the default regulator enable configuration structure in RUN state.
 *
 * This function initializes the PCA9422 regulator enable configuration structure in RUN state to default values.
 * The default values are as follows.
 *
 *   regEnCfg->sw1Enable       = true;
 *   regEnCfg->sw2Enable       = true;
 *   regEnCfg->sw3Enable       = true;
 *   regEnCfg->sw4Enable       = true;
 *   regEnCfg->ldo1Enable      = true;
 *   regEnCfg->ldo2Enable      = true;
 *   regEnCfg->ldo3Enable      = true;
 *   regEnCfg->ldo4Enable      = true;
 *
 * @param regEnCfg Pointer to the PCA9422 regulator enable configuration structure in RUN state.
 */
void PCA9422_GetDefaultRegEnableConfig(pca9422_regulatoren_t *regEnCfg);

/*!
 * @brief Gets the default buck config structure.
 *
 * This function initializes the PCA9422 buck config structure to default values. The default
 * values are as follows.
 *
 *   buckCfg->dvs_up_step   = 0;
 *   buckCfg->dvs_dn_step   = 0;
 *   buckCfg->dvs_ctrl      = kPCA9422_Bx_dvs_ctrl_i2c_in_active_sleep;
 *   buckCfg->ramp_speed    = kPCA9422_Bx_ramp_25mVp2us;
 *   buckCfg->lpmode        = kPCA9422_Bx_lpmode_normal;
 *   buckCfg->active_dischg = kPCA9422_Bx_enable_ad;
 *   buckCfg->fpwm_en       = kPCA9422_Bx_fpwm_auto;
 *   buckCfg->enmode        = kPCA9422_Reg_Enmode_on_all;
 *   buckCfg->dvs_vout[8]   = *dvs;
 *   buckCfg->stby_vout     = bx_standby_vout;
 *   buckCfg->max_vout      = bx_max_vout;
 *   buckCfg->sleep_vout    = bx_sleep_vout;
 *
 * @param buckCfg Pointer to the PCA9422 buck configuration structure.
 */
void PCA9422_GetDefaultBuckConfig(pca9422_buck_config_t *buckCfg);

/*!
 * @brief Gets the default LDO2/3/4 config structure.
 *
 * This function initializes the PCA9422 LDO2/3/4 config structure to default values. The default
 * values are as follows.
 *
 *   ldoCfg->csel          = kPCA9422_LDO23_csel_auto_cout_detection;
 *   ldoCfg->llsel         = kPCA9422_LDO23_llsel_15mOhm;
 *   ldoCfg->lpmode        = kPCA9422_LDO23_lpmode_normal;
 *   ldoCfg->ldo_mode      = kPCA9422_LDO23_mode_ldo;
 *   ldoCfg->active_dischg = true;
 *   ldoCfg->vout          = ldox_vout;
 *   ldoCfg->stby_vout     = ldox_stdy_vout;
 *   ldoCfg->sleep_vout    = ldox_sleep_vout;
 *
 * @param ldoCfg Pointer to the PCA9422 ldo234 configuration structure.
 */
void PCA9422_GetDefaultLDO234Config(pca9422_ldo234_config_t *ldoCfg);

/*!
 * @brief Gets the default LDO1 config structure.
 *
 * This function initializes the PCA9422 LDO1 config structure to default values. The default
 * values are as follows.

 bool active_dischg;
 bool enmode;
 uint32_t vout;
 *
 *   ldo1Cfg->active_dischg = true;
 *   ldo1Cfg->enmode        = true;
 *   ldo1Cfg->vout          = 1800000;
 *
 * @param ldo1Cfg Pointer to the PCA9422 LDO1 configuration structure.
 */
void PCA9422_GetDefaultLDO1Config(pca9422_ldo1_config_t *ldo1Cfg);

/*!
 * @brief Gets the default buck-boost config structure.
 *
 * This function initializes the PCA9422 buck-boost config structure to default values. The default
 * values are as follows.
 *
 *   bbCfg->fpwm_en     = kPCA9422_BB_fpwm_auto;
 *   bbCfg->oc_ctrl     = kPCA9422_BB_fault_oc_ctrl_not_turn_off;
 *   bbCfg->soft_stdn   = kPCA9422_BB_soft_stdn_disabled;
 *   bbCfg->passive_dis = kPCA9422_BB_dis_enabled;
 *   bbCfg->en_in_run   = kPCA9422_BB_enable_in_run_on;
 *   bbCfg->bb_mode     = kPCA9422_BB_mode_auto;
 *   bbCfg->enmode      = kPCA9422_BB_enmode_on_all;
 *   bbCfg->lpmode      = kPCA9422_BB_lpmode_normal;
 *   bbCfg->vout        = 5000000;
 *   bbCfg->stby_vout   = 5000000;
 *   bbCfg->max_vout    = 5000000;
 *   bbCfg->min_vout    = 4500000;
 *   bbCfg->sleep_vout  = 5000000;
 *
 * @param bbCfg Pointer to the PCA9422 buck-boost configuration structure.
 */
void PCA9422_GetDefaultBBConfig(pca9422_bb_config_t *bbCfg);

/*!
 * @brief Gets the current regulator enable mode.
 *
 * This function gets the current regulator enable mode of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @param reg Regulator of PCA9422.
 * @param enmode Enable mode of regulator.
 */
void PCA9422_GetRegulatorEnMode(pca9422_handle_t *handle, pca9422_regulator_t reg, pca9422_enmode_t *enmode);

/*!
 * @brief Sets the current regulator enable mode.
 *
 * This function sets the current regulator enable mode of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @param reg Regulator of PCA9422.
 * @param enmode Enable mode of regulator.
 */
void PCA9422_SetRegulatorEnMode(pca9422_handle_t *handle, pca9422_regulator_t reg, pca9422_enmode_t enmode);

/*!
 * @brief Get LDO1 enable mode.
 *
 * This function get LDO1 enable mode of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @param enmode Enable mode of regulator.
 */
void PCA9422_GetLDO1EnMode(pca9422_handle_t *handle, bool *enmode);

/*!
 * @brief Sets LDO1 enable mode.
 *
 * This function sets LDO1 enable mode of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @param enmode Enable mode of regulator.
 */
void PCA9422_SetLDO1EnMode(pca9422_handle_t *handle, bool enmode);

/*!
 * @brief Gets the current regulator power mode.
 *
 * This function gets the current regulator power mode of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @param reg Regulator of PCA9422.
 * @param lpmode Power mode of regulator.
 */
void PCA9422_GetRegulatorLPMode(pca9422_handle_t *handle, pca9422_regulator_t reg, pca9422_reg_lpmode_t *lpmode);

/*!
 * @brief Sets the current regulator power mode.
 *
 * This function sets the current regulator power mode of PCA9422.
 *
 * @param handle PCA9422 Handle.
 * @param reg Regulator of PCA9422.
 * @param lpmode Power mode of regulator.
 */
void PCA9422_SetRegulatorLPMode(pca9422_handle_t *handle, pca9422_regulator_t reg, pca9422_reg_lpmode_t lpmode);

/*!
 * @brief Sets voltage value in uV for vout mode.
 *
 * @param handle PCA9422 Handle.
 * @param reg Regulator of PCA9422.
 * @param vout Vout type of PCA9422.
 * @param volt Regulator voltage in uV of PCA9422.
 */
void PCA9422_SetRegulatorVoltage(pca9422_handle_t *handle, pca9422_regulator_t reg, pca9422_vout_t vout, uint32_t volt);

/*!
 * @brief Gets voltage value in uV for vout mode.
 *
 * @param handle PCA9422 Handle.
 * @param reg Regulator of PCA9422.
 * @param vout Vout type of PCA9422.
 * @param volt Regulator voltage in uV of PCA9422.
 */
void PCA9422_GetRegulatorVoltage(pca9422_handle_t *handle,
                                 pca9422_regulator_t reg,
                                 pca9422_vout_t vout,
                                 uint32_t *volt);

/*!
 * @brief Get PCA9422 SW1, SW2, SW3, SW4, LDO1, LDO2, LDO3, LDO4 OK status.
 *
 * This function return the PCA9422 regulators status.
 *
 * @param handle PCA9422 Handle.
 * @return ORed regulator status. see @ref pca9422_reg_status_t for regulator status definition.
 */
uint8_t PCA9422_GetRegulatorStatus(pca9422_handle_t *handle);

/*!
 * @brief Switch PCA9422 power mode.
 *
 * This function switch the PCA9422 regulators power mode with pin control.
 *
 * @param handle PCA9422 Handle.
 * @param mode Target power mode to go into.
 */
void PCA9422_SwitchPowerMode(pca9422_handle_t *handle, pca9422_power_mode_t mode);

/*!
 * @brief Get PCA9422 current power mode.
 *
 * This function returns the PCA9422 current power mode.
 *
 * @param handle PCA9422 Handle.
 * @param mode Current power mode.
 * @return true on success, false on failure.
 */
bool PCA9422_GetCurrentPowerMode(pca9422_handle_t *handle, pca9422_power_mode_t *mode);

/*!
 * @brief Get PCA9422 current EN mode.
 *
 * This function returns the PCA9422 current Enmode.
 *
 * @param handle PCA9422 Handle.
 * @param config Current Enmode configuration.
 */
void PCA9422_GetCurrentEnMode(pca9422_handle_t *handle, pca9422_enmodecfg_t *config);

/*!
 * @brief Get PCA9422 standby mode control.
 *
 * This function returns the PCA9422 standby mode control method.
 *
 * @param handle PCA9422 Handle.
 * @param ctrl Standby mode control.
 * @return true on success, false on failure.
 */
bool PCA9422_GetStandbyControl(pca9422_handle_t *handle, pca9422_standby_ctrl_t *ctrl);

/*!
 * @brief Sets Buck DVS control.
 *
 * @param handle PCA9422 Handle.
 * @param reg Buck Regulator
 * @param dvsCtrl Buck DVS control method.
 */
void PCA9422_SetBuckDVSControl(pca9422_handle_t *handle, pca9422_regulator_t reg, uint8_t dvsCtrl);

/*!
 * @brief Enable PCA9422 Regulator in Run state.
 *
 * @param handle PCA9422 Handle.
 * @param reg Regulator of PCA9422.
 * @param enable true is enable, false is disabled.
 */
void PCA9422_SetEnableRegulatorRunState(pca9422_handle_t *handle, pca9422_regulator_t reg, bool enable);

/*!
 * @brief Get Enable PCA9422 Regulator status in Run state.
 *
 * @param handle PCA9422 Handle.
 * @param reg Regulator of PCA9422.
 * @param enable true is enable, false is disabled.
 */
void PCA9422_GetEnableRegulatorRunState(pca9422_handle_t *handle, pca9422_regulator_t reg, bool *enable);

/*!
 * @brief Read PCA9422 power mode configurations for specific modes.
 *
 * This function read the PCA9422 mode configurations for specific modes with
 * user-defined settings.
 *
 * @param handle PCA9422 Handle.
 * @param powerMode Target mode to read.
 * @param configs Pointer to the configuration to save read information.
 */
void PCA9422_ReadPowerModeConfigs(pca9422_handle_t *handle, pca9422_power_mode_t powerMode, pca9422_modecfg_t *configs);

/*!
 * @brief Write PCA9422 power mode configurations for specific modes.
 *
 * This function write the PCA9422 mode configurations for specific modes with
 * user-defined settings.
 *
 * @param handle PCA9422 Handle.
 * @param powerMode Target mode to write.
 * @param configs Pointer to the configuration to save read information.
 */
void PCA9422_WritePowerModeConfigs(pca9422_handle_t *handle, pca9422_power_mode_t powerMode, pca9422_modecfg_t configs);

/*!
 * @brief Write PCA9422 enmode configurations for specific modes.
 *
 * This function write the PCA9422 enmode configurations for specific modes with
 * user-defined settings.
 *
 * @param handle PCA9422 Handle.
 * @param config Pointer to the configuration to save read information.
 */
void PCA9422_WriteEnModeConfig(pca9422_handle_t *handle, pca9422_enmodecfg_t config);

/*!
 * @brief Write PCA9422 Regulator enable configurations for run state.
 *
 * This function write the PCA9422 Regulator enable configurations for run state with
 * user-defined settings.
 *
 * @param handle PCA9422 Handle.
 * @param config Pointer to the configuration to save read information.
 */
void PCA9422_WriteRegEnableConfig(pca9422_handle_t *handle, pca9422_regulatoren_t config);

/*!
 * @brief Read PCA9422 regulator enable status for specific modes.
 *
 * This function read the PCA9422 enable status configurations for specific modes with
 * user-defined settings.
 *
 * @param handle PCA9422 Handle.
 * @param powerMode Target mode to read.
 * @param configs Pointer to the enable configuration to save read information.
 */
void PCA9422_ReadEnableConfigs(pca9422_handle_t *handle, pca9422_power_mode_t powerMode, pca9422_enablecfg_t *config);

/*!
 * @brief Feed PCA9422 watchdog.
 *
 * This function feed the PCA9422 watch dog.
 *
 * @param handle PCA9422 Handle.
 */
void PCA9422_FeedWatchDog(pca9422_handle_t *handle);

